In [2]:
import pandas as pd 
import numpy as np

# Intro to dataframes

In [3]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"])
df.head()
df.tail(2)

   a  b  c
1  4  5  6
2  7  8  9

In [4]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [7]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [8]:
df.nunique() # to find number of unique value in each

a    3
b    3
c    3
dtype: int64

In [9]:
df["a"].unique()# to find unique value in a specific column

array([1, 4, 7])

In [10]:
df.shape

(3, 3)

In [11]:
df.size

9

# loading data from a file

In [134]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [13]:
results = pd.read_parquet("./warmup-data/results.parquet")

results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [14]:
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

In [15]:
bios = pd.read_csv("./warmup-data/bios.csv")
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

# accessing data with pandas

### loc[], iloc[]

In [16]:
coffee.sample(5)

          Day Coffee Type  Units Sold
2     Tuesday    Espresso          30
1      Monday       Latte          15
5   Wednesday       Latte          25
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [17]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [18]:
coffee.loc[[0,4,6]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
4  Wednesday    Espresso          35
6   Thursday    Espresso          40

In [19]:
coffee.loc[5:12]

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45

In [20]:
coffee.loc[5:12, ["Day", "Units Sold"]]

          Day  Units Sold
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45

In [21]:
coffee.iloc[0:5,[0,2]]
# iloc stand for index_location loc for location

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [22]:
coffee.index = coffee["Day"]

In [23]:

# coffee.loc["Monday","Units Sold"]
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [24]:
# changing perticular value
coffee.loc[1,"Units Sold"]=10
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso        25.0
Monday        Monday       Latte        15.0
Tuesday      Tuesday    Espresso        30.0
Tuesday      Tuesday       Latte        20.0
Wednesday  Wednesday    Espresso        35.0

In [25]:
# wont ot get a specific item only one item then we can use at and iat
# coffee.at[0,"Day"]
# coffee.iat[0,0]

In [26]:
coffee["Units Sold"]

Day
Monday       25.0
Monday       15.0
Tuesday      30.0
Tuesday      20.0
Wednesday    35.0
Wednesday    25.0
Thursday     40.0
Thursday     30.0
Friday       45.0
Friday       35.0
Saturday     45.0
Saturday     35.0
Sunday       45.0
Sunday       35.0
1            10.0
Name: Units Sold, dtype: float64

In [27]:
# coffee.sort_values("Units Sold")
# coffee.sort_values("Units Sold", ascending=False)
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[False,True])

                 Day Coffee Type  Units Sold
Day
Friday        Friday    Espresso        45.0
Saturday    Saturday    Espresso        45.0
Sunday        Sunday    Espresso        45.0
Thursday    Thursday    Espresso        40.0
Wednesday  Wednesday    Espresso        35.0
Friday        Friday       Latte        35.0
Saturday    Saturday       Latte        35.0
Sunday        Sunday       Latte        35.0
Tuesday      Tuesday    Espresso        30.0
Thursday    Thursday       Latte        30.0
Monday        Monday    Espresso        25.0
Wednesday  Wednesday       Latte        25.0
Tuesday      Tuesday       Latte        20.0
Monday        Monday       Latte        15.0
1                NaN         NaN        10.0

In [28]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print()

Monday
Day              Monday
Coffee Type    Espresso
Units Sold         25.0
Name: Monday, dtype: object

Monday
Day            Monday
Coffee Type     Latte
Units Sold       15.0
Name: Monday, dtype: object

Tuesday
Day             Tuesday
Coffee Type    Espresso
Units Sold         30.0
Name: Tuesday, dtype: object

Tuesday
Day            Tuesday
Coffee Type      Latte
Units Sold        20.0
Name: Tuesday, dtype: object

Wednesday
Day            Wednesday
Coffee Type     Espresso
Units Sold          35.0
Name: Wednesday, dtype: object

Wednesday
Day            Wednesday
Coffee Type        Latte
Units Sold          25.0
Name: Wednesday, dtype: object

Thursday
Day            Thursday
Coffee Type    Espresso
Units Sold         40.0
Name: Thursday, dtype: object

Thursday
Day            Thursday
Coffee Type       Latte
Units Sold         30.0
Name: Thursday, dtype: object

Friday
Day              Friday
Coffee Type    Espresso
Units Sold         45.0
Name: Friday, dtype: object

Friday
Day            Friday
Coffee Type     Latte
Units Sold       35.0
Name: Friday, dtype: object

Saturday
Day            Saturday
Coffee Type    Espresso
Units Sold         45.0
Name: Saturday, dtype: object

Saturday
Day            Saturday
Coffee Type       Latte
Units Sold         35.0
Name: Saturday, dtype: object

Sunday
Day              Sunday
Coffee Type    Espresso
Units Sold         45.0
Name: Sunday, dtype: object

Sunday
Day            Sunday
Coffee Type     Latte
Units Sold       35.0
Name: Sunday, dtype: object

1
Day             NaN
Coffee Type     NaN
Units Sold     10.0
Name: 1, dtype: object

### filtering data

In [29]:
bios.sample(5)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
74781,75354,Lyudmila Galkina,1972-01-20,Saratov,Saratov,RUS,Russian Federation,172.0,59.0,NaN
45868,46215,Miloš Milošević,1972-05-10,Split,Splitsko-dalmatinska županija,CRO,Croatia,187.0,87.0,NaN
131279,134055,Will Fletcher,1989-12-24,Chester-le-Street,England,GBR,Great Britain,186.0,73.0,NaN
1824,1832,Sayed El-Nahas,1939-11-19,Al-Jizah (Giza),Al-Jizah,EGY,Egypt United Arab Republic,186.0,71.0,1994-11-29
127933,130423,Laura Siegemund,1988-03-04,Filderstadt,Baden-Württemberg,GER,Germany,168.0,62.0,NaN

In [30]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [31]:
# bios.loc[bios["height_cm"]>220,["name","height_cm"]]

# other way to do it 
bios[bios["height_cm"]>220][["name","height_cm"]]

# adding multiple condition

bios[(bios["height_cm"]>210) & (bios["born_country"]=="USA")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5681,5704,Walt Bellamy,1937-07-24,New Bern,North Carolina,USA,United States,211.0,98.0,2013-11-02
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5894,5919,Mel Counts,1941-10-16,Coos Bay,Oregon,USA,United States,213.0,102.0,NaN
6106,6133,Marc Freiberger,1928-11-27,Amarillo,Texas,USA,United States,211.0,98.0,2005-06-29
6281,6309,Darrall Imhoff,1938-10-11,San Gabriel,California,USA,United States,211.0,98.0,2017-06-30
6379,6410,Joe Kleine,1962-01-04,Colorado Springs,Colorado,USA,United States,211.0,122.0,NaN
6393,6424,Jon Koncak,1963-05-17,Cedar Rapids,Iowa,USA,United States,213.0,113.0,NaN
6442,6473,Christian Laettner,1969-08-17,Angola,New York,USA,United States,211.0,107.0,NaN
6615,6648,Tom McMillen,1952-05-26,Mansfield,Pennsylvania,USA,United States,212.0,95.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
7012,7048,Daniel Santiago,1976-06-24,Tarpon Springs,Florida,USA,Puerto Rico,213.0,111.0,NaN
112319,113575,Chris Kaman,1982-04-28,Wyoming,Michigan,USA,Germany,213.0,122.0,NaN
112366,113622,Dwight Howard,1985-12-08,Atlanta,Georgia,USA,United States,211.0,120.0,NaN
118573,120309,Al-Farouq Aminu,1990-09-21,Atlanta,Georgia,USA,Nigeria,211.0,98.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
132188,135037,Domantas Sabonis,1996-05-03,Portland,Oregon,USA,Lithuania,211.0,109.0,NaN
133332,136271,DeAndre Jordan,1988-07-21,Houston,Texas,USA,United States,211.0,120.0,NaN
142044,145640,Jahlil Okafor,1995-12-15,Fort Smith,Arkansas,USA,Nigeria,211.0,NaN,NaN
142930,146560,Mike Tobey,1994-10-10,Monroe,New York,USA,Slovenia,213.0,NaN,NaN
143712,147367,JaVale McGee,1988-01-19,Flint,Michigan,USA,United States,213.0,NaN,NaN

In [32]:
bios[bios["name"].str.contains("Keshav")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19037,19171,Keshav Dutt,1925-12-29,Lahore,Punjab,PAK,India,NaN,NaN,2021-07-07
42522,42845,Keshav Sen,1923-09-21,Kharwa,Madhya Pradesh,IND,India,172.0,72.0,NaN
58291,58705,Keshav Mangave,1926-06-10,NaN,NaN,NaN,India,NaN,NaN,1997-07-11
58304,58718,Keshav Roy,1926-01-01,NaN,NaN,NaN,India,NaN,NaN,NaN
99707,100506,Shiva Keshavan,1981-08-25,Delhi,National Capital Territory of Delhi,IND,Independent Olympic Athletes India,183.0,85.0,NaN

In [33]:
bios[bios["born_country"].isin(["USA","IND"])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
80,81,George Caridia,1869-02-20,Kolkata (Calcutta),West Bengal,IND,Great Britain,NaN,NaN,1937-04-21
101,102,Algernon Kingscote,1888-02-03,Bengaluru (Bangalore),Karnataka,IND,Great Britain,NaN,NaN,1964-12-21
270,271,Nora Polley,1894-07-29,Budaun,Uttar Pradesh,IND,India,NaN,NaN,1988-01-01
273,274,Zeeshan Ali,1970-01-01,Kolkata (Calcutta),West Bengal,IND,India,180.0,64.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145445,149168,Kristen Santos,1994-11-02,Fairfield,Connecticut,USA,United States,NaN,NaN,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN

In [37]:
bios.query('born_country == "USA" and born_city =="Seattle"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

### adding and removing column

In [47]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [57]:
coffee["Price"]= 4.99

In [49]:
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [50]:
coffee["new_price"]= np.where(coffee["Coffee Type"]== "Espresso",3.99,4.99)

In [51]:
coffee.head()

         Day Coffee Type  Units Sold  Price  new_price
0     Monday    Espresso          25   4.99       3.99
1     Monday       Latte          15   4.99       4.99
2    Tuesday    Espresso          30   4.99       3.99
3    Tuesday       Latte          20   4.99       4.99
4  Wednesday    Espresso          35   4.99       3.99

In [58]:
# coffee.drop(columns=["Price"]) # this not really modify the actual data to do it we need to do 
coffee.drop(columns=["Price"],inplace=True)

In [55]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       4.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       4.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       4.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       4.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       4.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       4.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       4.99

In [63]:
new_coffee=coffee.copy()
new_coffee["price"]=10

In [65]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       4.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       4.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       4.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       4.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       4.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       4.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       4.99

In [66]:
new_coffee

          Day Coffee Type  Units Sold  new_price  price
0      Monday    Espresso          25       3.99     10
1      Monday       Latte          15       4.99     10
2     Tuesday    Espresso          30       3.99     10
3     Tuesday       Latte          20       4.99     10
4   Wednesday    Espresso          35       3.99     10
5   Wednesday       Latte          25       4.99     10
6    Thursday    Espresso          40       3.99     10
7    Thursday       Latte          30       4.99     10
8      Friday    Espresso          45       3.99     10
9      Friday       Latte          35       4.99     10
10   Saturday    Espresso          45       3.99     10
11   Saturday       Latte          35       4.99     10
12     Sunday    Espresso          45       3.99     10
13     Sunday       Latte          35       4.99     10

In [68]:
coffee["revenue"]=coffee["Units Sold"]*coffee["new_price"]
coffee.head()

         Day Coffee Type  Units Sold  new_price  revenue
0     Monday    Espresso          25       3.99    99.75
1     Monday       Latte          15       4.99    74.85
2    Tuesday    Espresso          30       3.99   119.70
3    Tuesday       Latte          20       4.99    99.80
4  Wednesday    Espresso          35       3.99   139.65

In [71]:
coffee.rename(columns={"new_price":"cost"}, inplace=True)
coffee.head()

         Day Coffee Type  Units Sold  cost  revenue
0     Monday    Espresso          25  3.99    99.75
1     Monday       Latte          15  4.99    74.85
2    Tuesday    Espresso          30  3.99   119.70
3    Tuesday       Latte          20  4.99    99.80
4  Wednesday    Espresso          35  3.99   139.65

In [79]:
bios.head()
bios_new=bios.copy()
bios_new["first_name"]=bios_new['name'].str.split(" ").str[0]

In [76]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [80]:
bios_new["born_time"] = pd.to_datetime(bios["born_date"])

In [81]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
 11  born_time     143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

In [82]:
bios_new["born_year"]= bios_new["born_time"].dt.year

In [83]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_time,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0

In [86]:
bios_new["hight_category"]= bios_new["height_cm"].apply(lambda x: "short" if x<150 else "average" if x<200 else "tall")

In [85]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_time,born_year,hight_cata
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,tall

In [87]:
def category_weight(row):
    if row["weight_kg"]<70:
        return "lightweight"
    elif row["weight_kg"]<85:
        return "averageweight"
    else:
        return "heavyweight"
bios_new["weight_category"]= bios.apply(category_weight,axis=1)

In [88]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_time,born_year,hight_cata,hight_category,weight_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,tall,tall,heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,average,average,averageweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,average,average,averageweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,average,average,lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,tall,tall,heavyweight

### merging and concatenating data

In [89]:
noc_data=pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/noc_regions.csv")

In [96]:
noc_data
noc_data.to_csv("./warmup-data/noc_regions.csv")

In [91]:
bios_new = pd.merge(bios_new, noc_data,left_on="born_country", right_on="NOC" , how="left")

In [92]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,first_name,born_time,born_year,hight_cata,hight_category,weight_category,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,tall,tall,heavyweight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,average,average,averageweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,average,average,averageweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,average,average,lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,tall,tall,heavyweight,GBR,UK,NaN

In [94]:
bios_new.rename(columns={"region":"born_country_full"},inplace=True)

In [95]:
bios_new[bios_new["born_country_full"] != bios_new["NOC_x"]]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,first_name,born_time,born_year,hight_cata,hight_category,weight_category,NOC_y,born_country_full,notes
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,tall,tall,heavyweight,GBR,UK,NaN
12,13,J. Defert,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,J.,NaT,NaN,tall,tall,heavyweight,NaN,NaN,NaN
13,14,Étienne Durand,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,Étienne,NaT,NaN,tall,tall,heavyweight,NaN,NaN,NaN
16,17,Guy Forget,1965-01-04,Casablanca,Casablanca-Settat,MAR,France,189.0,79.0,NaN,Guy,1965-01-04,1965.0,average,average,averageweight,MAR,Morocco,NaN
27,28,"Guy, Baron Lejeune",NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,"Guy,",NaT,NaN,tall,tall,heavyweight,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Matthew,1989-12-05,1989.0,tall,tall,heavyweight,NaN,NaN,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,Landysh,1998-08-31,1998.0,tall,tall,heavyweight,RUS,Russia,NaN
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,average,average,lightweight,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,average,average,lightweight,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,average,average,lightweight,RUS,Russia,NaN

In [98]:
usa = bios[bios["born_country"]=="USA"].copy()
ind = bios[bios["born_country"]=="IND"].copy()

In [101]:
ind.sample(10)
usa.sample(10)

new_df=pd.concat([usa,ind])

In [104]:
new_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
140286,143790,Bajrang Punia,1994-02-26,Khudan,Haryana,IND,India,NaN,NaN,NaN
140287,143791,Deepak Punia,1999-05-19,Jhajjar,Haryana,IND,India,NaN,NaN,NaN
143996,147660,Sumit Nagal,1997-08-16,Jhajjar,Haryana,IND,India,NaN,NaN,NaN
144114,147784,Diksha Dagar,2000-12-14,Jhajjar,Haryana,IND,India,174.0,NaN,NaN
144757,148458,Arif Khan,1990-03-09,Gulmarg,Jammu and Kashmir,IND,India,NaN,NaN,NaN

In [105]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [107]:
conbined_df=pd.merge(results,bios ,on="athlete_id",how="left")
conbined_df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02

### handling null value in a data

In [135]:

coffee.loc[3:4, "Units Sold"]=np.nan
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso        25.0
1     Monday       Latte        15.0
2    Tuesday    Espresso        30.0
3    Tuesday       Latte         NaN
4  Wednesday    Espresso         NaN

In [111]:
coffee.isna().sum()

Day            0
Coffee Type    0
Units Sold     2
cost           0
revenue        0
dtype: int64

In [113]:
coffee.fillna(coffee["Units Sold"].mean())

          Day Coffee Type  Units Sold  cost  revenue
0      Monday    Espresso        35.0  3.99    99.75
1      Monday       Latte        35.0  4.99    74.85
2     Tuesday    Espresso        30.0  3.99   119.70
3     Tuesday       Latte        20.0  4.99    99.80
4   Wednesday    Espresso        35.0  3.99   139.65
5   Wednesday       Latte        25.0  4.99   124.75
6    Thursday    Espresso        40.0  3.99   159.60
7    Thursday       Latte        30.0  4.99   149.70
8      Friday    Espresso        45.0  3.99   179.55
9      Friday       Latte        35.0  4.99   174.65
10   Saturday    Espresso        45.0  3.99   179.55
11   Saturday       Latte        35.0  4.99   174.65
12     Sunday    Espresso        45.0  3.99   179.55
13     Sunday       Latte        35.0  4.99   174.65

In [121]:
coffee.head()
coffee.loc[2,"Units Sold"]=15

In [ ]:
# coffee["Units Sold"]=coffee["Units Sold"].interpolate()
# / fill nan balue based on value in their surrounding

In [133]:
coffee.dropna(subset=["Units Sold"],inplace=True)
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso        15.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [ ]:
coffee[coffee["Units Sold"].isna()]

         Day Coffee Type  Units Sold
3    Tuesday       Latte         NaN
4  Wednesday    Espresso         NaN

In [138]:
coffee[coffee["Units Sold"].notna()]

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso        30.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0